import {
  Link,
  List,
  ListItem,
  ListItemText,
  ListSubheader,
  Typography,
} from "@mui/material";

const ExchangeReturnPolicyContent = () => {
  return (
    <List component="ol">
      <ListItem>
        <ListItemText
          primary={
            <>
              Компанія здійснює повернення відповідно до Закону{" "}
              <Link
                href="https://zakon.rada.gov.ua/laws/show/172-94-%D0%BF#Text"
                target="_blank"
                underline="none"
                sx={{ "&:hover": { textDecoration: "underline" } }}
              >
                «Про захист прав споживачів»
              </Link>
              . Статтею 9 чинного Закону України «Про захист прав споживачів»
              передбачено право споживача обміняти непродовольчий товар належної
              якості на аналогічний, якщо куплений товар не підійшов за формою,
              габаритами, фасоном, кольором, розміром або з інших причин не може
              бути використаний за призначенням, якщо даний товар не
              використовувався і якщо збережено його товарний вигляд, споживчі
              властивості, пломби, ярлики та розрахунковий документ, виданий
              продавцем разом з товаром. Продавець не має права відмовити в
              обміні (поверненні) товару, що не включений до переліку, якщо він
              відповідає всім вимогам, передбаченим ст. 9 Закону (збережений
              товарний вигляд, ярлики, пломби, є розрахунковий документ і т.
              ін.).
            </>
          }
        />
      </ListItem>

      <ListSubheader>
        <Typography
          sx={{ fontWeight: "bolder" }}
          color="secondary.main"
          variant="h6"
        >
          Виключення
        </Typography>
      </ListSubheader>

      <ListItem>
        <ListItemText
          primary={
            <>
              Кабінетом Міністрів України затверджено перелік товарів належної
              якості, що не підлягають обміну або поверненню (Постанова КМУ від
              19 березня 1994 № 172). З актуальним вичерпним Переліком можна
              ознайомитися{" "}
              <Link
                href="https://zakon.rada.gov.ua/laws/show/172-94-%D0%BF#Text"
                target="_blank"
                underline="none"
                sx={{ "&:hover": { textDecoration: "underline" } }}
              >
                за посиланням
              </Link>
              .
            </>
          }
        />
      </ListItem>

      <ListSubheader>
        <Typography
          sx={{ fontWeight: "bolder" }}
          color="secondary.main"
          variant="h6"
        >
          Додаткові умови повернення та обміну
        </Typography>
      </ListSubheader>

      <ListItem>
        <ListItemText
          primary="
Товар підлягає обміну або поверненню на протязi 14 днів з моменту його отримання, при дотриманні певних умов, які описанні вище.
          "
        />
      </ListItem>
      <ListItem>
        <ListItemText
          primary="
Для повернення або обміну, Ви можете звернутися за номерами телефонів вказаних у нас на сайті. Транспортні витрати при поверненні або обміні товару, за рахунок покупця! Відправляти посилку необхідно Новою Поштою, обов'язково БЕЗ післяплати: кур'єр не в праві перевірити товар і відправити Вам післяплату.           "
        />
      </ListItem>
      <ListItem>
        <ListItemText
          primary="
При поверненні товару, на протязi 3 днів після отримання нами посилки і перевірки товару, кошти перераховуються на надані Вами банківські реквізити. Обмін товару відбувається напротязі 3-х днів після отримання нашим кур'єром на відділенні Нової Пошти. Приємних покупок!"
        />
      </ListItem>
    </List>
  );
};

export default ExchangeReturnPolicyContent;
