import {
  List,
  ListItem,
  ListItemText,
  ListSubheader,
  Typography,
} from "@mui/material";

const PrivacyPolicyContent = ({ subheaderVariant = "h6" }) => {
  return (
    <List component="ol">
      <ListItem>
        <ListItemText primary="Ця політика конфіденційності та захисту персональних даних визначає порядок одержання, зберігання, обробки й використання інформації, що була отримана в процесі використання сайту: www.sheva-shop.com (далі – Сайт)." />
      </ListItem>
      <ListItem>
        <ListItemText
          primary="
Сайт відповідально ставиться до дотримання права кожного відвідувача на конфіденційність персональних даних і вживає всі необхідні заходи для забезпечення високого рівня захисту оброблюваних персональних даних від несанкціонованого доступу.         
         "
        />
      </ListItem>
      <ListItem>
        <ListItemText
          primary="
Використовуючи Сайт, користувач (надалі - Користувач) підтверджує, що ознайомився та повністю (однозначно) погодився з умовами цієї політики конфіденційності та умовами обробки персональних даних Користувача.         
         "
        />
      </ListItem>
      <ListItem>
        <ListItemText
          primary="
Користувач не має права використовувати Сайт, якщо не згодний та не погоджується з умовами цієї політики конфіденційності та або Угодою з користувачем у вигляді Публічної оферти.          
         "
        />
      </ListItem>
      <ListItem>
        <ListItemText
          primary="
Політика конфіденційності розроблена відповідно до Закону України «Про захист персональних данних», інших законів та підзаконних нормативно-правових актів, які регулюють відносини у сфері захисту персональних даних.
Чинна політика конфіденційності стосується лише Сайту. Цей інтернет-сайт не контролює і не несе відповідальність за сайти третіх осіб, на які Користувач може перейти за посиланнями, доступним на Сайті.         
         "
        />
      </ListItem>

      <ListItem>
        <ListItemText
          primary="
У цій політиці конфіденційності використовуються такі терміни:"
          sx={{ fontWeight: "!important bold" }}
        />
      </ListItem>
      <ListItem>
        <ListItemText
          primary="
            Адміністрація сайту інтернет-сайту (надалі – Адміністрація) – уповноважені співробітники на управління Сайтом, що діють від імені чи в інтересах інтернет-сайта Sheva-shop, які організовують і здійснюють обробку персональних даних, а також визначають цілі обробки персональних даних, склад персональних даних, що підлягають обробці, дії або операції, що здійснюються з персональними даними.
         "
        />
      </ListItem>
      <ListItem>
        <ListItemText
          primary="
            Розпорядник персональних даних – фізична чи юридична особа, якій власником персональних даних або законом надано право обробляти ці дані. Не є розпорядником персональних даних особа, якій власником та/або розпорядником бази персональних даних доручено здійснювати роботи технічного характеру з базою персональних даних без доступу до змісту персональних даних.
         "
        />
      </ListItem>
      <ListItem>
        <ListItemText
          primary="
Одержувач – фізична чи юридична особа, якій надаються персональні дані, у тому числі третя особа.
Персональні дані – відомості чи сукупність відомостей про фізичну особу, що ідентифікована або може бути конкретно ідентифікована.         "
        />
      </ListItem>
      <ListItem>
        <ListItemText
          primary="
Конфіденційність персональних даних – обов'язкова для дотримання Адміністратором Сайту або іншою особою, що отримала доступ до персональних даних, вимога не допускати їх поширення без згоди суб'єкта персональних даних або наявності іншої законної підстави.         "
        />
      </ListItem>
      <ListItem>
        <ListItemText
          primary="
Загальнодоступні джерела персональних даних  довідники, адресні книги, реєстри, списки, каталоги, інші систематизовані збірники відкритої інформації, які містять персональні дані, розміщені та опубліковані з відома суб’єкта персональних даних.         "
        />
      </ListItem>
      <ListItem>
        <ListItemText
          primary="
Користувач Сайту (Покупець/Споживач) – суб’єкт персональних даних.
"
        />
      </ListItem>
      <ListItem>
        <ListItemText
          primary="
Фізична особа, яка відвідує Сайт, повинна володіти необхідним обсягом дієздатності.  Не може збиратися та оброблятися інформація від фізичної особи, яка не досягла 18 років без дозволу чи під наглядом законних представників такої особи. "
        />
      </ListItem>
      <ListItem>
        <ListItemText
          primary="
Згода суб’єкта персональних даних – будь-яке документоване, добровільне волевиявлення фізичної особи щодо надання дозволу на обробку її персональних даних відповідно до сформульованої мети їх обробки."
        />
      </ListItem>
      <ListItem>
        <ListItemText
          primary="
Обліковий запис Користувача – це відомості про Користувача надані ним під час заповнення полів на Сайті, які дозволяють однозначно ідентифікувати Користувача в процесі використання ним Сайту. Обліковий запис створюється Користувачем під час реєстрації на Сайті. Для отримання доступу до свого Облікового запису Користувач використовує повідомлені ним при реєстрації адресу електронної пошти та пароль."
        />
      </ListItem>
      <ListItem>
        <ListItemText
          primary="
Знеособлення персональних даних – вилучення відомостей, які дають змогу прямо чи опосередковано ідентифікувати особу.
Відповідальна особа – визначена власником чи розпорядником персональних даних особа, яка організовує роботу, пов’язану із захистом персональних даних при їх обробці, інформує та консультує власника або розпорядника персональних даних з питань додержання законодавства про захист персональних даних. "
        />
      </ListItem>

      <ListSubheader>
        <Typography
          variant={subheaderVariant}
          sx={{ fontWeight: "bolder" }}
          color="secondary.main"
        >
          1. Мета збору та обробки персональних даних Користувача
        </Typography>
      </ListSubheader>
      <ListItem>
        <ListItemText
          primary="
Метою обробки персональних даних у системі є зберігання та обслуговування даних контрагентів, відповідно до статей 6, 7 Закону України «Про захист персональних даних».

"
        />
      </ListItem>
      <ListItem>
        <ListItemText
          primary="
Персональні дані Користувача Адміністрація Сайту може використовувати для забезпечення реалізації цивільно-правових відносин, укладених через Сайт: www.sheva-shop.com, надання/отримання та здійснення розрахунків за придбані товари/послуги відповідно до законодавства України, а також:
"
        />
      </ListItem>
      <List component="ol" disablePadding sx={{ paddingLeft: 4 }}>
        <ListItem>
          <ListItemText
            primary="
          - реєстрації та авторизації Користувача на Сайті;
          "
          />
        </ListItem>
        <ListItem>
          <ListItemText
            primary="
          - надання Користувачеві доступу до персоналізованих ресурсів;
          "
          />
        </ListItem>
        <ListItem>
          <ListItemText
            primary="
          - створення облікового запису для здійснення покупок, якщо Користувач надав згоду на створення облікового запису;

          "
          />
        </ListItem>
        <ListItem>
          <ListItemText
            primary="
          - надання Користувачеві ефективної клієнтської і технічної підтримки при виникненні проблем пов'язаних з використанням Сайту;

          "
          />
        </ListItem>
        <ListItem>
          <ListItemText
            primary="
- оформлення та розміщення замовлення на товари та послуги;

          "
          />
        </ListItem>
        <ListItem>
          <ListItemText
            primary="
- виконання Продавцем умов договору купівлі-продажу товару на відстані;

          "
          />
        </ListItem>
        <ListItem>
          <ListItemText
            primary="
- доставки товарів, що замовив Користувач;

          "
          />
        </ListItem>
        <ListItem>
          <ListItemText
            primary="
- встановлення зворотного зв’язку з Користувачем, включаючи направлення повідомлень, запитів, що стосуються використання Сайту, обробки запитів, замовлень, заявок від Користувача;

          "
          />
        </ListItem>
        <ListItem>
          <ListItemText
            primary="
- визначення місця знаходження Користувача для забезпечення безпеки, запобігання шахрайства;

          "
          />
        </ListItem>
        <ListItem>
          <ListItemText
            primary="
- підтвердження достовірності та повноти персональних даних, наданих Користувачем;

          "
          />
        </ListItem>
        <ListItem>
          <ListItemText
            primary="
- обробки і отримання платежів, підтвердження податку або податкових пільг Користувачем;

          "
          />
        </ListItem>
        <ListItem>
          <ListItemText
            primary="
- маркетингових цілей;

          "
          />
        </ListItem>
        <ListItem>
          <ListItemText
            primary="
- аналіз зручності Користування Сайтом.

          "
          />
        </ListItem>
      </List>
      <ListItem>
        <ListItemText
          primary="
Якщо Користувач погодився отримувати інформацію про нові продукти й спеціальні пропозиції,   обробляє його дані, щоб надіслати йому свою комерційну (рекламну) інформацію, наприклад, щодо поточних програм лояльності, акцій, спеціальних пропозицій або розпродажі тощо.
Обробка персональних даних здійснюється відкрито і прозоро із застосуванням засобів та у спосіб, що відповідають визначеним цілям такої обробки.
У разі зміни визначеної мети обробки персональних даних на нову мету, яка є несумісною з попередньою, для подальшої обробки даних власник персональних даних повинен отримати згоду суб'єкта персональних даних на обробку його даних відповідно до зміненої мети, якщо інше не передбачено чинним законодавством України.
"
        />
      </ListItem>

      <ListSubheader>
        <Typography
          variant={subheaderVariant}
          sx={{ fontWeight: "bolder" }}
          color="secondary.main"
        >
          2. Склад персональних даних, які підлягають обробці
        </Typography>
      </ListSubheader>

      <ListItem>
        <ListItemText
          primary="Сайт  обробляє ті або інші персональні дані, залежно від мети обробки, які, загалом, будуть такими:
"
        />
      </ListItem>

      <List component="ol" disablePadding sx={{ paddingLeft: 4 }}>
        <ListItem>
          <ListItemText
            primary="
          - ім’я та прізвище Користувача (Покупця/Споживача);
          "
          />
        </ListItem>
        <ListItem>
          <ListItemText
            primary="- адреса електронної пошти;
          "
          />
        </ListItem>
        <ListItem>
          <ListItemText
            primary="
            - стать (обравши форму звертання пані/пан);

          "
          />
        </ListItem>
        <ListItem>
          <ListItemText
            primary="- адреса доставки; 

          "
          />
        </ListItem>
        <ListItem>
          <ListItemText
            primary="
            - номер телефону;

          "
          />
        </ListItem>
        <ListItem>
          <ListItemText
            primary="
            - дата народження (надається за бажанням Користувача (Покупця/Споживача);

          "
          />
        </ListItem>
        <ListItem>
          <ListItemText
            primary="
          "
          />
        </ListItem>
        <ListItem>
          <ListItemText
            primary="
            - інформація про придбання, замовлення, повернення;

          "
          />
        </ListItem>
        <ListItem>
          <ListItemText
            primary="
            - комерційна інформація (у випадку, якщо Користувач підписався на розсилку Сайту);

          "
          />
        </ListItem>
        <ListItem>
          <ListItemText
            primary="
- інформацію про підключення, географічне положення, перегляди (якщо Користувач взаємодієте з нами з мобільного телефону чи будь-якого іншого пристрою);

          "
          />
        </ListItem>
      </List>

      <ListItem>
        <ListItemText primary="У випадку, якщо Покупець розриває договір та повертаєте товар належної якості або Sheva-shop задовольняє його скаргу щодо повернення товару неналежної якості і здійснює повернення коштів безпосередньо на його банківський рахунок, Покупець повинен зазначити відповідний номер банківського рахунку, на який   може перерахувати розмір такого повернення." />
      </ListItem>

      <ListSubheader>
        <Typography
          variant={subheaderVariant}
          sx={{ fontWeight: "bolder" }}
          color="secondary.main"
        >
          3. Правові підстави обробки даних
        </Typography>
      </ListSubheader>
      <ListItem>
        <ListItemText
          primary="
Для забезпечення захисту персональних даних Користувачів, ця Політика конфіденційності розроблена Сайтом з урахуванням положень законодавства України, зокрема: Закону України «Про захист персональних даних», Закону України «Про електронну комерцію», Закону України «Про інформацію» та інших нормативно-правових актів.
"
        />
      </ListItem>
      <ListItem>
        <ListItemText
          primary="
Адміністрація Сайту обробляє персональні дані Користувача лише у разі наявності його згоди, наданої під час реєстрації на Сайті та створення Користувачем облікового запису. Під час створення облікового запису, натиснувши позначку «Створити обліковий запис» Користувач погоджується з Політикою конфіденційності та надає згоду на обробку персональних даних. Згода на обробку персональних даних може відбиратися шляхом проставлення відповідної відмітки у графі «Я надаю згоду на обробку персональних даних та погоджуюсь з Політикою конфіденційності» або в будь який інший спосіб зафіксувати свою згоду з цими Умовами."
        />
      </ListItem>
      <ListItem>
        <ListItemText
          primary="
Згода на обробку персональних даних є повністю добровільною. Відсутність згоди на обробку персональних даних не надає можливість зареєструватися на Сайті, користуватися обліковим записом, оформлювати замовлення, послуги, купувати товари на Сайті. Згода Користувача надається під час оформлення цивільно-правових відносин відповідно до чинного законодавства."
        />
      </ListItem>
      <ListItem>
        {" "}
        <ListItemText
          primary="
Сайт не перевіряє достовірність наданої Користувачем персональної інформації і не здійснює контроль за її актуальністю.  Сайт виходить з того, що Користувач надає достовірну інформацію і підтримує цю інформацію в актуальному стані. Всю відповідальність, а також можливі наслідки за надання недостовірної, неточної, неповної, помилкової чи неактуальної інформації несе Користувач (Покупець/ Споживач)."
        />
      </ListItem>
      <ListItem>
        <ListItemText
          primary="
Забороняється обробка персональних даних про расове або етнічне походження, політичні, релігійні або світоглядні переконання, членство в політичних партіях та професійних спілках, а також даних, що стосуються здоров’я чи статевого життя (особливі категорії даних)."
        />
      </ListItem>
      <ListItem>
        <ListItemText
          primary="
Обробка персональних даних Користувача здійснюється без обмеження терміну, будь-яким законним способом, в тому числі в інформаційних системах персональних даних з використанням засобів автоматизації або без використання таких засобів."
        />
      </ListItem>
      <ListItem>
        <ListItemText
          primary="
Ця Політика конфіденційності обов’язкова також для застосування відповідальною особою та співробітниками продавця, які безпосередньо здійснюють обробку та/або мають доступ до персональних даних у зв’язку з виконанням своїх посадових обов’язків."
        />
      </ListItem>

      <ListSubheader>
        <Typography
          variant={subheaderVariant}
          sx={{ fontWeight: "bolder" }}
          color="secondary.main"
        >
          4. Права Користувача у зв’язку з передачею та обробкою персональних
          даних:
        </Typography>
      </ListSubheader>

      <List component="ol" disablePadding sx={{ paddingLeft: 4 }}>
        <ListItem>
          <ListItemText
            primary="
            - знати про джерела збирання, місцезнаходження своїх персональних даних, мету їх обробки, місцезнаходження або місце проживання (перебування) власника чи розпорядника персональних даних або надати відповідне доручення щодо отримання цієї інформації уповноваженим ним особам, крім випадків, встановлених чинним законодавством України;

          "
          />
        </ListItem>
        <ListItem>
          <ListItemText
            primary="
- отримувати інформацію про умови надання доступу до персональних даних, зокрема інформацію про третіх осіб, яким передаються його персональні дані;

          "
          />
        </ListItem>
        <ListItem>
          <ListItemText
            primary="
- на доступ до своїх персональних даних;

          "
          />
        </ListItem>
        <ListItem>
          <ListItemText
            primary="
- отримувати не пізніше, як за 30 календарних днів з дня надходження письмового запиту, крім випадків, передбачених чинним законодавством України, відповідь про те, чи обробляються його персональні дані, а також отримувати зміст таких персональних даних;

          "
          />
        </ListItem>
        <ListItem>
          <ListItemText
            primary="
- пред'являти вмотивовану вимогу власнику персональних даних із відмовою обробки своїх персональних даних;

          "
          />
        </ListItem>
        <ListItem>
          <ListItemText
            primary="
- пред'являти вмотивовану вимогу щодо зміни або знищення своїх персональних даних будь-яким власником та розпорядником персональних даних, якщо ці дані обробляються незаконно чи є недостовірними. Також, право відкликати свою згоду на збір та обробку персональних даних в будь-який час без зазначення причин. Запит може бути про відкликання згоди на обробку частково, наприклад відкликання згоди на отримання комерційної інформації, або про відкликання згоди на обробку повністю. У разі відкликання згоди на обробку персональних даних повністю обліковий запис Користувача на Сайті видаляється, а дані більше не обробляються. Відкликання згоди не вплине на жодну здійснену раніше діяльність.

          "
          />
        </ListItem>
        <ListItem>
          <ListItemText
            primary="
- на захист персональних даних від незаконної обробки та випадкової втрати, знищення, пошкодження у зв'язку з умисним приховуванням, ненаданням чи несвоєчасним їх наданням, а також на захист від надання відомостей, що є недостовірними чи ганьблять честь, гідність та ділову репутацію фізичної особи;

          "
          />
        </ListItem>
        <ListItem>
          <ListItemText
            primary="
- звертатися із скаргами на обробку персональних даних до уповноважених органів або до суду;

          "
          />
        </ListItem>
        <ListItem>
          <ListItemText
            primary="
- застосовувати засоби правового захисту в разі порушення законодавства про захист персональних даних;

          "
          />
        </ListItem>
        <ListItem>
          <ListItemText
            primary="
- вносити застереження стосовно обмеження права на обробку своїх персональних даних під час надання згоди;

          "
          />
        </ListItem>
        <ListItem>
          <ListItemText
            primary="
- відкликати згоду на обробку персональних даних;

          "
          />
        </ListItem>
        <ListItem>
          <ListItemText
            primary="
- знати механізм автоматичної обробки персональних даних;

          "
          />
        </ListItem>
        <ListItem>
          <ListItemText
            primary="
- на захист від автоматизованого рішення, яке має для нього правові наслідки.          

          "
          />
        </ListItem>
      </List>

      <ListItem>
        <ListItemText
          primary="
Адміністрація інтернет-сайту Sheva-shop зобов’язана інформувати Користувача про вжиті дії не пізніше, ніж протягом 1-го (одного) календарного місяця з дати отримання кожного з запитів Користувача.         
"
        />
      </ListItem>

      <ListSubheader>
        <Typography
          variant={subheaderVariant}
          sx={{ fontWeight: "bolder" }}
          color="secondary.main"
        >
          5. Період зберігання персональних даних
        </Typography>
      </ListSubheader>
      <ListItem>
        <ListItemText
          primary="Строк дії згоди на обробку персональних даних необмежений. У будь-якому випадку, тривалість зберігання персональних даних буде залежати від цілей та мети обробки, які наводяться у цій Політиці конфіденційності, але не більше ніж 10 років.
Адміністрація інтернет-сайту Sheva-shop зберігає дані Користувача до моменту видалення облікового запису Користувача на Сайті: www.sheva-shop.com. Обліковий запис Користувача може видалятися за його запитом, а також у разі відкликання згоди Користувача на обробку персональних даних, відмови від обробки персональних даних або вимоги про їх видалення.
"
        />
      </ListItem>
      <ListItem>
        <ListItemText
          primary="У системах інтернет-сайту БукБанда зберігатиметься тільки архівна інформація, яка пов’язана зі збереженням даних про, наприклад, транзакції, будь-які претензії, які Користувач може мати, зокрема протягом встановленого нормативно-правовими актами гарантійного строку або у зв’язку із законодавством, яким регламентується діяльність інтернет-сайту БукБанда.
Після того, як Користувач (суб’єкт персональних даних) перестав бути Користувачем Сайту шляхом видалення свого облікового запису на Сайті, його персональні дані також автоматично видаляються."
        />
      </ListItem>

      <ListSubheader>
        <Typography
          variant={subheaderVariant}
          sx={{ fontWeight: "bolder" }}
          color="secondary.main"
        >
          6. Спілкування щодо персональних даних
        </Typography>
      </ListSubheader>

      <ListItem>
        <ListItemText primary="Будь-які повідомлення або запити, пов’язані з персональними даними, можна надсилати адміністрації інтернет-сайту Sheva-shop зручним для Користувача способом, за допомогою відкритих контактних даних." />
      </ListItem>

      <ListSubheader>
        <Typography
          variant={subheaderVariant}
          sx={{ fontWeight: "bolder" }}
          color="secondary.main"
        >
          7. Довіреність на обробку персональних даних
        </Typography>
      </ListSubheader>

      <ListItem>
        {" "}
        <ListItemText
          primary="
Сайт може доручити обробку персональних даних діловим партнерам, якщо це необхідно для здійснення транзакцій, наприклад для підготовки товарів, що замовив Користувач, а також для відправлення товарів або передачі комерційної інформації (останнє стосується тих Користувачів, які погодилися отримувати комерційну інформацію), або для інших цілей, досягнення яких потрібно для належного виконання замовлень Користувачем."
        />
      </ListItem>

      <ListItem>
        <ListItemText
          primary="
Персональні дані Користувача можуть бути передані уповноваженим органам державної влади України тільки на підставах та в порядку, встановленим чинним законодавством України."
        />
      </ListItem>
      <ListItem>
        {" "}
        <ListItemText
          primary="
Користувач погоджується з тим, що адміністрація Сайту має право передавати персональні дані третім особам, зокрема, кур'єрським службам, організаціями поштового зв'язку, операторам електрозв'язку, виключно з метою виконання замовлення Користувача, оформленого на Сайті інтернет-сайту, включаючи доставку товару. "
        />
      </ListItem>
      <ListItem>
        {" "}
        <ListItemText
          primary="
Порядок доступу до персональних даних третіх осіб визначається умовами згоди Користувача (суб'єкта персональних даних) на обробку цих даних, наданої володільцю персональних даних, або відповідно до вимог закону. "
        />
      </ListItem>
      <ListItem>
        <ListItemText
          primary="
Доступ до персональних даних Користувача третій особі не надається, якщо зазначена особа відмовляється взяти на себе зобов'язання щодо забезпечення виконання вимог Закону України «Про захист персональних даних» або неспроможна їх забезпечити."
        />
      </ListItem>

      <ListSubheader>
        <Typography
          variant={subheaderVariant}
          sx={{ fontWeight: "bolder" }}
          color="secondary.main"
        >
          8. Електронні комерційні повідомлення – розсилка. Відмова підписки на
          електронну розсилку
        </Typography>
      </ListSubheader>

      <ListItem>
        <ListItemText
          primary="
Користувач може підписатися на розсилку від адміністрації Сайту, зазначивши свою адресу електронної пошти або номер телефону й погодившись на обробку персональних даних із метою отримання комерційної та маркетингової інформації електронною поштою або в текстових повідомленнях. "
        />
      </ListItem>
      <ListItem>
        <ListItemText
          primary="
Адміністрація Сайту використовує розсилку новин і текстових повідомлень для інформування про останні пропозиції (наприклад, про нові товари, послуги, спеціальні пропозиції, акції, знижки або розпродаж)."
        />
      </ListItem>
      <ListItem>
        <ListItemText
          primary="
Користувач має право контролювати отримання електронних комерційних повідомлень Інтернет-сайту БукБанда."
        />
      </ListItem>
      <ListItem>
        <ListItemText
          primary="
Користувач може в будь-який час відмовитися від підписки на розсилку новин і текстових повідомлень."
        />
      </ListItem>

      <ListSubheader>
        <Typography
          variant={subheaderVariant}
          sx={{ fontWeight: "bolder" }}
          color="secondary.main"
        >
          9. Повідомлення про наявність товару
        </Typography>
      </ListSubheader>
      <ListItem>
        <ListItemText
          primary="
За запитом Користувача, надісланими електронними засобами комунікації,   повідомляє про наявність потрібних товарів. Таке повідомлення можна надіслати тільки за умови, якщо Користувач погодився отримувати комерційну інформацію (розсилку) про товари інтернет-сайту Sheva-shop на вказану адресу електронної пошти та на обробку своїх персональних даних. Користувач надає свої дані на добровільній основі, але відсутність його згоди на обробку персональних даних позбавляє адміністрацію Сайту інтернет-сайту Sheva-shop можливості повідомляти його про наявність товару/послуги."
        />
      </ListItem>

      <ListSubheader>
        <Typography
          variant={subheaderVariant}
          sx={{ fontWeight: "bolder" }}
          color="secondary.main"
        >
          10. Файли cookies
        </Typography>
      </ListSubheader>
      <ListItem>
        <ListItemText
          primary="
Для роботи Сайту інтернет-сайту Sheva-shop використовуються файли cookies. Файли cookies – це невеликі файли, які дозволяють пристроям, які застосовується Користувачами для перегляду веб-сторінок (наприклад, комп’ютер, смартфон), зберігати деяку інформацію про його пристрій. Інформація, яка записана в файлах cookies, використовується, наприклад, з рекламною та статистичною метою та для адаптації Сайту інтернет-сайту Sheva-shop до індивідуальних потреб Користувача. Він може змінити налаштування файлів cookies у своєму веб-браузері. Якщо налаштування залишаться незмінними, файли cookies зберігатимуться на пристрої. Зміна налаштувань cookies може обмежити функціональність Сайту інтернет-сайту Sheva-shop. 
"
        />
      </ListItem>
      <ListItem>
        <ListItemText
          primary="
Користувач може управляти та/або видаляти, обмежувати або блокувати cookies файли з Сайту в будь-який час шляхом модифікації конфігурації браузеру.
"
        />
      </ListItem>
      <ListItem>
        <ListItemText
          primary="
Якщо Користувач не бажає використовувати cookies файли на Сайті, то Користувач повинен спочатку відключити cookies файли на своєму браузері."
        />
      </ListItem>
      <ListItem>
        <ListItemText
          primary="
Продовжуючи користування Сайтом, Користувач приймає політику інтернет-сайту з використання cookies файлів."
        />
      </ListItem>

      <ListSubheader>
        <Typography
          variant={subheaderVariant}
          sx={{ fontWeight: "bolder" }}
          color="secondary.main"
        >
          11. Додаткові умови
        </Typography>
      </ListSubheader>
      <ListItem>
        <ListItemText
          primary="
Сайт  має право вносити зміни до Політики конфіденційності в односторонньому порядку."
        />
      </ListItem>
      <ListItem>
        <ListItemText
          primary="
Політика конфіденційності з внесеними змінами вступає в силу з моменту її розміщення на Сайті, якщо інше не передбачено новою редакцією Політики конфіденційності."
        />
      </ListItem>
      <ListItem>
        <ListItemText
          primary="
Всі пропозиції, зауваження та питання з приводу Політики конфіденційності надсилаються на адресу Сайту або шляхом відправки  електронного листа на електронну адресу."
        />
      </ListItem>
    </List>
  );
};

export default PrivacyPolicyContent;
